# Homebrew packages

# CLI tools
brew "git"
brew "gemini-cli"
brew "go"
brew "hugo"
brew "fastfetch"
brew "gromgit/fuse/ntfs-3g-mac" #usefull for Mounty
# brew "mackup" don't work on macos sonoma and later
tap "sass/sass"
brew "sass/sass/sass"
# brew "python"
brew "zsh"
brew "htmltest" # per testare siti statici come quelli generati da hugo

# Clipboard manager
# tap "matthewpick/pesto-clipboard"
# brew "pesto-clipboard"

# GUI apps (cask)
# cask "amule" # non funziona
cask "appcleaner"
cask "applite"
cask "bitwarden"
cask "brave-browser"
cask "coteditor" # Simple code/text editor
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "localsend"
cask "lulu"
cask "macdown"
cask "macfuse" #usefull for Mounty
cask "monitorcontrol"
cask "mounty"
cask "obsidian"
cask "optimage" # Image optimization
cask "pearcleaner"
cask "syncthing-app"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Fonts (cask fonts)
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "font-source-serif-4"

# Mac App Store apps
mas "Brother iPrint&Scan", id: 1193539993
mas "Trello", id: 1278508951
