# Homebrew packages

# CLI tools
brew "git"
brew "go"
brew "hugo"
brew "mackup"
brew "sass/sass/sass"
# brew "python"
brew "zsh"

# GUI apps (cask)
cask "amule" # non funziona
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "localsend"
cask "lulu"
cask "macdown"
cask "monitorcontrol"
cask "mounty"
cask "obsidian"
cask "syncthing"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Fonts (cask fonts)
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
# cask "font-source-sans-pro"
cask "font-source-serif-4"
# cask "font-source-serif-pro"

# Mac App Store apps
mas "Brother iPrint&Scan", id: 1193539993
mas "Trello", id: 1278508951
